In [51]:
import pandas as pd
from sqlalchemy import create_engine

#EXTRACT
#TRANSFORM
#LOAD

### EXTRACT Gold JSON into a DataFrame

In [52]:
gold_json = "Resources/gold.json"
gold_df = pd.read_json(gold_json)
gold_df.head()

        Date  Price
0 1950-01-01  34.73
1 1950-02-01  34.73
2 1950-03-01  34.73
3 1950-04-01  34.73
4 1950-05-01  34.73

In [53]:
pd.to_datetime(gold_df["Date"])

0     1950-01-01
1     1950-02-01
2     1950-03-01
3     1950-04-01
4     1950-05-01
         ...
842   2020-03-01
843   2020-04-01
844   2020-05-01
845   2020-06-01
846   2020-07-01
Name: Date, Length: 847, dtype: datetime64[ns]

In [54]:
gold_df.dtypes

Date     datetime64[ns]
Price           float64
dtype: object

In [55]:
gold_df.head()

        Date  Price
0 1950-01-01  34.73
1 1950-02-01  34.73
2 1950-03-01  34.73
3 1950-04-01  34.73
4 1950-05-01  34.73

In [56]:
gold_df_ranged = gold_df.loc[gold_df["Date"] >= "1953-03-30", :]
gold_df_ranged.head()

         Date  Price
39 1953-04-01  34.93
40 1953-05-01  34.90
41 1953-06-01  34.89
42 1953-07-01  34.91
43 1953-08-01  34.91

### TRANSFORM GOLD

In [57]:
equal_start_date = gold_df_ranged.copy()

equal_start_date.set_index("Date", inplace=True)
equal_start_date.head()
gold_df = equal_start_date.copy()
gold_df.head()

            Price
Date
1953-04-01  34.93
1953-05-01  34.90
1953-06-01  34.89
1953-07-01  34.91
1953-08-01  34.91

### EXTRACT SP500 CSV into DataFrame

In [114]:
SP500 = "Resources/SP500_Data.csv"
SP500_df = pd.read_csv(SP500)
SP500_df.head()

        Date SP500
0  1/01/1900   6.1
1  1/02/1900  6.21
2  1/03/1900  6.26
3  1/04/1900  6.34
4  1/05/1900  6.04

In [115]:
pd.to_datetime(SP500_df["Date"])
SP500_df["Date"] = pd.to_datetime(SP500_df["Date"])

In [116]:
SP500_df.dtypes

Date     datetime64[ns]
SP500            object
dtype: object

In [117]:
unique = SP500_df["Date"].unique()
unique

array(['1900-01-01T00:00:00.000000000', '1900-01-02T00:00:00.000000000',
       '1900-01-03T00:00:00.000000000', ...,
       '2020-01-11T00:00:00.000000000', '2020-01-12T00:00:00.000000000',
       '2021-01-01T00:00:00.000000000'], dtype='datetime64[ns]')

In [119]:
SP500_df.describe()

                       Date SP500
count                  1453  1453
unique                 1453  1260
top     1921-01-12 00:00:00  7.68
freq                      1     6
first   1900-01-01 00:00:00   NaN
last    2021-01-01 00:00:00   NaN

In [120]:
SP500_df["SP500"] = pd.to_numeric(SP500_df["SP500"].str.replace(",",""))

In [121]:
#gold_df_ranged = gold_df.loc[gold_df["Date"] >= "1953-03-30", :]
SP500_df_ranged = SP500_df.loc[SP500_df["Date"] >= "01/04/1953", :]
SP500_df_ranged.head()

          Date  SP500
639 1953-01-04  24.71
640 1953-01-05  24.84
641 1953-01-06  23.95
642 1953-01-07  24.29
643 1953-01-08  24.39

In [109]:
#SP500_df_ranged

In [122]:
SP500_df.dtypes

Date     datetime64[ns]
SP500           float64
dtype: object

In [111]:
#SP500_df_ranged["SP500"].str.replace(",","")

In [ ]:
#SP500_df_ranged["SP500"].str.replace(",","")

In [123]:


SP500_df_ranged.set_index("Date", inplace=True)
SP500_df_ranged.head()

            SP500
Date
1953-01-04  24.71
1953-01-05  24.84
1953-01-06  23.95
1953-01-07  24.29
1953-01-08  24.39

### EXTRACT Silver into DataFrame

In [65]:
silver = "Resources/Silver_Data.csv"
silver_df = pd.read_csv(silver)
silver_df.head()

     Date   Price    Open    High     Low Change %
0  Sep 21  24.186  23.909  24.267  23.756    1.26%
1  Aug 21  23.885  25.540  26.035  22.525   -6.19%
2  Jul 21  25.460  26.123  26.780  24.485   -2.48%
3  Jun 21  26.108  28.062  28.560  25.530   -6.93%
4  May 21  28.051  25.925  28.765  25.800    8.31%

In [66]:
pd.to_datetime(silver_df["Date"],format= "%b %y")
silver_df["Date"] = pd.to_datetime(silver_df["Date"], format = "%b %y")
silver_df.head()
#formatstr, default None
#formatstr, default None

        Date   Price    Open    High     Low Change %
0 2021-09-01  24.186  23.909  24.267  23.756    1.26%
1 2021-08-01  23.885  25.540  26.035  22.525   -6.19%
2 2021-07-01  25.460  26.123  26.780  24.485   -2.48%
3 2021-06-01  26.108  28.062  28.560  25.530   -6.93%
4 2021-05-01  28.051  25.925  28.765  25.800    8.31%

In [67]:
silver_dp_df = silver_df[['Date', 'Price']].copy()
silver_dp_df.head()

        Date   Price
0 2021-09-01  24.186
1 2021-08-01  23.885
2 2021-07-01  25.460
3 2021-06-01  26.108
4 2021-05-01  28.051

In [68]:
silver_dp_df = silver_dp_df.loc[silver_dp_df["Date"] >= "01/04/1953", :]
silver_dp_df.head()

        Date   Price
0 2021-09-01  24.186
1 2021-08-01  23.885
2 2021-07-01  25.460
3 2021-06-01  26.108
4 2021-05-01  28.051

In [69]:
silver_dp_df = silver_dp_df.sort_values(by="Date")
silver_dp_df.head()

          Date  Price
469 1982-08-01   7.97
468 1982-09-01   8.11
467 1982-10-01   9.86
466 1982-11-01   9.85
465 1982-12-01  10.90

In [70]:
silver_dp_df.set_index("Date", inplace=True)
silver_dp_df.head()

            Price
Date
1982-08-01   7.97
1982-09-01   8.11
1982-10-01   9.86
1982-11-01   9.85
1982-12-01  10.90

### EXTRACT 10 Yr T-Bill into DataFrame

In [71]:
tenyear_json = "Resources/tenyear.json"
ten_df = pd.read_json(tenyear_json)
ten_df.head()

        Date  Rate
0 1953-04-30  2.83
1 1953-05-31  3.05
2 1953-06-30  3.11
3 1953-07-31  2.93
4 1953-08-31  2.95

In [72]:
ten_df.dtypes

Date    datetime64[ns]
Rate           float64
dtype: object

In [73]:
pd.to_datetime(ten_df["Date"])
ten_df["Date"] = pd.to_datetime(ten_df["Date"])

In [74]:
ten_df.head()

        Date  Rate
0 1953-04-30  2.83
1 1953-05-31  3.05
2 1953-06-30  3.11
3 1953-07-31  2.93
4 1953-08-31  2.95

In [75]:
ten_df.dtypes

Date    datetime64[ns]
Rate           float64
dtype: object

In [76]:
ten_df.set_index("Date", inplace=True)
ten_df.head()

            Rate
Date
1953-04-30  2.83
1953-05-31  3.05
1953-06-30  3.11
1953-07-31  2.93
1953-08-31  2.95

### Create database connection

In [77]:
asset_connection_string = "postgres:2021AirushLift8M@localhost:5432/asset_db"
engine = create_engine(f'postgresql://{asset_connection_string}')

In [78]:
# Confirm tables
engine.table_names()

['silver', 'gold', 'sp500', 'tenyear_bill', 'SP500']

### Load DataFrames into database

In [87]:
gold_df.to_sql(name='gold', con=engine, if_exists='append', index=True)

In [86]:
gold_df.head()

            Price
Date
1953-04-01  34.93
1953-05-01  34.90
1953-06-01  34.89
1953-07-01  34.91
1953-08-01  34.91

In [124]:
SP500_df_ranged.to_sql(name='SP500', con=engine, if_exists='append', index=True)

In [89]:
SP500_df_ranged.dtypes

SP500    object
dtype: object

In [82]:
silver_dp_df.to_sql(name='silver', con=engine, if_exists='append', index=True)

In [85]:
ten_df.to_sql(name='tenyear_bill', con=engine, if_exists='append', index=True)